# Chapter 8

# Hierarchical Indexing

In [355]:
import pandas as pd
import numpy as np

In [356]:
data = pd.Series(np.random.uniform(size=9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], [1,2,3,1,3,1,2,2,3]])

In [357]:
data

a  1    0.355743
   2    0.298557
   3    0.663320
b  1    0.131705
   3    0.038897
c  1    0.997216
   2    0.898472
d  2    0.828261
   3    0.338756
dtype: float64

In [358]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

you can slice it!

In [359]:
data['b']

1    0.131705
3    0.038897
dtype: float64

In [360]:
data.loc[['b','d']]

b  1    0.131705
   3    0.038897
d  2    0.828261
   3    0.338756
dtype: float64

In [361]:
data.loc[:,2]

a    0.298557
c    0.898472
d    0.828261
dtype: float64

Hierarchical indexing plays an important role in reshaping data and in group-based operations like forming a pivot table. For example, you can rearrange this data into a DataFrame using its unstack method:

In [362]:
data.unstack()

          1         2         3
a  0.355743  0.298557  0.663320
b  0.131705       NaN  0.038897
c  0.997216  0.898472       NaN
d       NaN  0.828261  0.338756

The inverse operation of unstack is stack:

In [363]:
data.unstack().stack()

a  1    0.355743
   2    0.298557
   3    0.663320
b  1    0.131705
   3    0.038897
c  1    0.997216
   2    0.898472
d  2    0.828261
   3    0.338756
dtype: float64

In [364]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                    columns=[["Ohio", "Ohio", "Colorado"],
                            ["Green", "Red", "Green"]])

In [365]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [366]:
frame.index.names = ['key1','key2']

In [367]:
frame.columns.names = ['state','color']

In [368]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

Be careful to note that the index names "state" and "color" are not part of the row labels (the frame.index values).

You can see how many levels an index has by accessing its nlevels attribute:

In [369]:
frame.index.nlevels

2

With partial column indexing you can similarly select groups of columns

In [370]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

A MultiIndex can be created by itself and then reused; the columns in the preceding DataFrame with level names could also be created like this:

In [371]:
pd.MultiIndex.from_arrays([["Ohio", "Ohio", "Colorado"],
                          ["Green", "Red", "Green"]],
                          names=["state", "color"])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

you can reorder the levels on an axis or sort the data by the values in one specific level

In [372]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [373]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

#  Summary Statistics by Level

In [374]:
frame.groupby(level='key2').sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [375]:
frame.T.groupby(level="color").sum()

key1   a      b
key2   1  2   1   2
color
Green  2  8  14  20
Red    1  4   7  10

#  Indexing with a DataFrame's columns

In [376]:
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
                      "c": ["one", "one", "one", "two", "two",
                            "two", "two"],
                      "d": [0, 1, 2, 0, 1, 2, 3]})

In [377]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

you can turn ccolumns into the index with set_index

In [378]:
frame2 = frame.set_index(['c','d'])

In [379]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

by default the comluns used are dropped from thew index. oyu can leave them in with

In [380]:
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

you can reverse the process with reset_index()

In [381]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# Combining and Merging Datasets

Data contained in pandas objects can be combined in a number of ways:

pandas.merge
Connect rows in DataFrames based on one or more keys. This will be familiar to users of SQL or other relational databases, as it implements database join operations.

pandas.concat
Concatenate or "stack" objects together along an axis.

combine_first
Splice together overlapping data to fill in missing values in one object with values from another.

#  Database-Style DataFrame Joins

pandas.merge function in pandas is the main entry point for using these algorithms on your data.

In [382]:
df1 = pd.DataFrame({'key': ['b','b','a','c','a','a','b'],
                   'data1': pd.Series(range(7), dtype='int64')})

In [383]:
df2 = pd.DataFrame({'key': ['a','b','d'],
                   'data2': pd.Series(range(3), dtype='Int64')})

In [384]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [385]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

This is an example of a many-to-one join; the data in df1 has multiple rows labeled a and b, whereas df2 has only one row for each value in the key column. Calling pandas.merge with these objects, we obtain:

In [386]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

Note that I didn’t specify which column to join on. If that information is not specified, pandas.merge uses the overlapping column names as the keys. It’s a good practice to specify explicitly, though:

In [387]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [388]:
df3 = pd.DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
                    "data1": pd.Series(range(7), dtype="Int64")})

In [389]:
df4 = pd.DataFrame({"rkey": ["a", "b", "d"],
                    "data2": pd.Series(range(3), dtype="Int64")})

If the column names are different in each object, you can specify them separately:

In [390]:
pd.merge(df3,df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

because c is not shared by both dfs it is excluded unless we use an outer join

In [391]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   a    2.0      0
1   a    4.0      0
2   a    5.0      0
3   b    0.0      1
4   b    1.0      1
5   b    6.0      1
6   c    3.0   <NA>
7   d    NaN      2

In [392]:
pd.merge(df3,df4, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    a      2    a      0
1    a      4    a      0
2    a      5    a      0
3    b      0    b      1
4    b      1    b      1
5    b      6    b      1
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

Table 8.1: Different join types with the how argument
Option	Behavior


how="inner"	Use only the key combinations observed in both tables


how="left"	Use all key combinations found in the left table


how="right"	Use all key combinations found in the right table


how="outer"	Use all key combinations observed in both tables together

Many-to-many merges form the Cartesian product of the matching keys. Here’s an example:

In [393]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','b'],
                   'data1': pd.Series(range(6), dtype='Int64')})

In [394]:
df2 = pd.DataFrame({'key':['a','b','a','b','d'],
                   'data2': pd.Series(range(5), dtype='Int64')})

In [395]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [396]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [397]:
pd.merge(df1,df2, on='key', how='left')

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

Since there were three "b" rows in the left DataFrame and two in the right one, there are six "b" rows in the result. The join method passed to the how keyword argument affects only the distinct key values appearing in the result:

In [398]:
pd.merge(df1,df2,how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

To merge with multiple keys, pass a list of column names:

In [399]:
left = pd.DataFrame({"key1": ["foo", "foo", "bar"],
                     "key2": ["one", "two", "one"],
                     "lval": pd.Series([1, 2, 3], dtype='Int64')})

In [400]:
right = pd.DataFrame({"key1": ["foo", "foo", "bar", "bar"],
                      "key2": ["one", "one", "one", "two"],
                      "rval": pd.Series([4, 5, 6, 7], dtype='Int64')})

In [401]:
pd.merge(left,right, on =['key1','key2'], how='outer')

  key1 key2  lval  rval
0  bar  one     3     6
1  bar  two  <NA>     7
2  foo  one     1     4
3  foo  one     1     5
4  foo  two     2  <NA>

Caution:

When you're joining columns on columns, the indexes on the passed DataFrame objects are discarded. If you need to preserve the index values, you can use reset_index to append the index to the columns.

A last issue to consider in merge operations is the treatment of overlapping column names. For example:

In [402]:
pd.merge(left,right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

While you can address the overlap manually (see the section Ch 7.2.4: Renaming Axis Indexes for renaming axis labels), pandas.merge has a suffixes option for specifying strings to append to overlapping names in the left and right DataFrame objects:

In [403]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

Table 8.2: pandas.merge function arguments
Argument	Description



left	DataFrame to be merged on the left side.



right	DataFrame to be merged on the right side.



how	Type of join to apply: one of "inner", "outer", "left", or "right"; defaults to "inner".



on	Column names to join on. Must be found in both DataFrame objects. If not specified and no other join keys given, will use the intersection of the column 



names in left and right as the join keys.



left_on	Columns in left DataFrame to use as join keys. Can be a single column name or a list of column names.



right_on	Analogous to left_on for right DataFrame.



left_index	Use row index in left as its join key (or keys, if a MultiIndex).




right_index	Analogous to left_index.



sort	Sort merged data lexicographically by join keys; False by default.



suffixes	Tuple of string values to append to column names in case of overlap; defaults to ("_x", "_y") (e.g., if "data" in both DataFrame objects, would appear 


as "data_x" and "data_y" in result).



copy	If False, avoid copying data into resulting data structure in some exceptional cases; by default always copies.



validate	Verifies if the merge is of the specified type, whether one-to-one, one-



to-many, or many-to-many. See the docstring for full details on the options.




indicator	Adds a special column _merge that indicates the source of each row; values will be "left_only", "right_only", or "both" based on the origin of the joined data in each row.

# Merging on Index

In [404]:
left1 = pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                      "value": pd.Series(range(6), dtype="Int64")})

In [405]:
right1 = pd.DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [406]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [407]:
right1

   group_val
a        3.5
b        7.0

In [408]:
pd.merge(left1,right1,left_on='key',right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

With hierarchically indexed data, things are more complicated, as joining on index is equivalent to a multiple-key merge:

In [409]:
lefth = pd.DataFrame({"key1": ["Ohio", "Ohio", "Ohio",
                               "Nevada", "Nevada"],
                      "key2": [2000, 2001, 2002, 2001, 2002],
                      "data": pd.Series(range(5), dtype="Int64")})

In [410]:
righth_index = pd.MultiIndex.from_arrays(
        [["Nevada", "Nevada", "Ohio", "Ohio", "Ohio", "Ohio"],
            [2001, 2000, 2000, 2000, 2001, 2002]
    ]
)

In [411]:
righth = pd.DataFrame({"event1": pd.Series([0, 2, 4, 6, 8, 10], dtype="Int64",
                                           index=righth_index),
                       "event2": pd.Series([1, 3, 5, 7, 9, 11], dtype="Int64",
                                           index=righth_index)})

In this case, you have to indicate multiple columns to merge on as a list (note the handling of duplicate index values with how="outer"):

In [412]:
pd.merge(lefth, righth, left_on=["key1", "key2"], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1

In [413]:
pd.merge(lefth,righth,left_on=['key1','key2'],
            right_index=True, how='outer')

     key1  key2  data  event1  event2
4  Nevada  2000  <NA>       2       3
3  Nevada  2001     3       0       1
4  Nevada  2002     4    <NA>    <NA>
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11

you can alos use the indexes of both sides of the merge

In [414]:
left2 = pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]],
                    index=['a','c','e'],
                    columns=['Ohio','Nevada']).astype('Int64')

In [415]:
right2 = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14.]],
                      index=['b','c','d','e'],
                      columns=['Missouri','Alabama']).astype('Int64')

In [416]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [417]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [418]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

DataFrame has a join instance method to simplify merging by index. It can also be used to combine many DataFrame objects having the same or similar indexes but nonoverlapping columns. In the prior example, we could have written:

In [419]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [420]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

Lastly, for simple index-on-index merges, you can pass a list of DataFrames to join as an alternative to using the more general pandas.concat function described in the next section:

In [421]:
another = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],
                      index=['a','c','e','f'],
                      columns=['New York','Oregon'])

In [422]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [423]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
c     3       4         9       10       9.0    10.0
e     5       6        13       14      11.0    12.0

In [424]:
left2.join([right2,another],how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
c     3       4         9       10       9.0    10.0
e     5       6        13       14      11.0    12.0
b  <NA>    <NA>         7        8       NaN     NaN
d  <NA>    <NA>        11       12       NaN     NaN
f  <NA>    <NA>      <NA>     <NA>      16.0    17.0

#  Concatenating Along an Axis

Another kind of data combination operation is referred to interchangeably as concatenation or stacking. NumPy's concatenate function can do this with NumPy arrays:

In [425]:
arr = np.arange(12).reshape((3,4))

In [426]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [427]:
#np.concatenate([arr,arr],axis=1)
np.concatenate([arr,arr],axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In the context of pandas objects such as Series and DataFrame, having labeled axes enable you to further generalize array concatenation. In particular, you have a number of additional concerns:

If the objects are indexed differently on the other axes, should we combine the distinct elements in these axes or use only the values in common?

Do the concatenated chunks of data need to be identifiable as such in the resulting object?

Does the "concatenation axis" contain data that needs to be preserved? In many cases, the default integer labels in a DataFrame are best discarded during concatenation.

The concat function in pandas provides a consistent way to address each of these questions. I’ll give a number of examples to illustrate how it works. Suppose we have three Series with no index overlap:

In [428]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")

In [429]:
s2 = pd.Series([2,3,4], index=['c','d','e'], dtype='Int64')

In [430]:
s3 = pd.Series([5,6], index=['f','g'], dtype='Int64')

In [431]:
s1

a    0
b    1
dtype: Int64

In [432]:
s2

c    2
d    3
e    4
dtype: Int64

In [433]:
s3

f    5
g    6
dtype: Int64

In [434]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [435]:
pd.concat([s1,s2,s3], axis='columns')

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [436]:
s4 = pd.concat([s1,s3])

In [437]:
s4

a    0
b    1
f    5
g    6
dtype: Int64

In [438]:
pd.concat([s1, s4], axis="columns")

      0  1
a     0  0
b     1  1
f  <NA>  5
g  <NA>  6

In [439]:
pd.concat([s1,s4], axis='columns', join='inner')

   0  1
a  0  0
b  1  1

In [440]:
result = pd.concat([s1,s2,s3], keys=['one','two','three'])

In [441]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: Int64

In [442]:
result.unstack()

          a     b     c     d     e     f     g
one       0     1  <NA>  <NA>  <NA>  <NA>  <NA>
two    <NA>  <NA>     2     3     4  <NA>  <NA>
three  <NA>  <NA>  <NA>  <NA>  <NA>     5     6

In the case of combining Series along axis="columns", the keys become the DataFrame column headers:

In [443]:
pd.concat([s1,s2,s3], axis='columns', keys=['one','two','three'])

    one   two  three
a     0  <NA>   <NA>
b     1  <NA>   <NA>
c  <NA>     2   <NA>
d  <NA>     3   <NA>
e  <NA>     4   <NA>
f  <NA>  <NA>      5
g  <NA>  <NA>      6

The same logic extends to DataFrame objects:

In [444]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=["a", "b", "c"],
                   columns=["one", "two"])

In [445]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=["a", "c"],
                   columns=["three", "four"])

In [446]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [447]:
df2

   three  four
a      5     6
c      7     8

In [448]:
pd.concat([df1,df2], axis='columns', keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

you can achieve the same results with

In [449]:
pd.concat({'level1':df1,'level2':df2}, axis='columns')

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

There are additional arguments governing how the hierarchical index is created (see Table 8.3). For example, we can name the created axis levels with the names argument:

In [450]:
pd.concat({'level1':df1,'level2':df2}, axis='columns', names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

A last consideration concerns DataFrames in which the row index does not contain any relevant data:

In [451]:
df1 = pd.DataFrame(np.random.standard_normal((3,4)),
                  columns=['a','b','c','d'])

In [452]:
df2 = pd.DataFrame(np.random.standard_normal((2,3)),
                  columns=['b','d','a'])

In [453]:
df1

          a         b         c         d
0  0.971291  1.599375  0.413451  0.238959
1  0.654146  0.330528 -0.070590 -1.678646
2 -0.302656 -1.891423 -0.005468 -1.386324

In [454]:
df2

          b         d         a
0  1.688885 -1.665607  1.576322
1 -2.545819 -0.634269 -1.565735

In [455]:
pd.concat([df1,df2], ignore_index=True)

          a         b         c         d
0  0.971291  1.599375  0.413451  0.238959
1  0.654146  0.330528 -0.070590 -1.678646
2 -0.302656 -1.891423 -0.005468 -1.386324
3  1.576322  1.688885       NaN -1.665607
4 -1.565735 -2.545819       NaN -0.634269

Table 8.3: pandas.concat function arguments


Argument	Description


objs	List or dictionary of pandas objects to be concatenated; this is the only required argument


axis	Axis to concatenate along; defaults to concatenating along rows (axis="index")



join	Either "inner" or "outer" ("outer" by default); whether to intersect (inner) or 

union (outer) indexes along the other axes


keys	Values to associate with objects being concatenated, forming a hierarchical index along the concatenation axis; can be a list or array of arbitrary values, an array of tuples, or a list of arrays (if multiple-level arrays passed in levels)



levels	Specific indexes to use as hierarchical index level or levels if keys passed


names	Names for created hierarchical levels if keys and/or levels passed



verify_integrity	Check new axis in concatenated object for duplicates and raise an exception if so; by default (False) allows duplicates



ignore_index	Do not preserve indexes along concatenation axis, instead produce a new range(total_length) index

#  Combining Data with Overlap

In [456]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
         index=['f','e','d','c','b','a'])

In [457]:
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.],
             index=['a','b','c','d','e','f'])

In [458]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [459]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [460]:
np.where(pd.isna(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

Here, whenever values in a are null, values from b are selected, otherwise the non-null values from a are selected.

to line up values by index use:

In [461]:
a.combine_first(b)

a    0.0
b    4.5
c    3.5
d    0.0
e    2.5
f    5.0
dtype: float64

With DataFrames, combine_first does the same thing column by column, so you can think of it as “patching” missing data in the calling object with data from the object you pass:

In [462]:
df1 = pd.DataFrame({"a": [1., np.nan, 5., np.nan],
                    "b": [np.nan, 2., np.nan, 6.],
                    "c": range(2, 18, 4)})

In [463]:
df2 = pd.DataFrame({"a": [5., 4., np.nan, 3., 7.],
                    "b": [np.nan, 3., 4., 6., 8.]})

In [464]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [465]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [466]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

The output of combine_first with DataFrame objects will have the union of all the column names.

#  Reshaping with Hierarchical Indexing

Hierarchical indexing provides a consistent way to rearrange data in a DataFrame. There are two primary actions:

stack
This “rotates” or pivots from the columns in the data to the rows.

unstack
This pivots from the rows into the columns.

I’ll illustrate these operations through a series of examples. Consider a small DataFrame with string arrays as row and column indexes:

In [467]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(["Ohio", "Colorado"], name="state"),
                    columns=pd.Index(["one", "two", "three"],
                                     name="number"))

In [468]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [469]:
result = data.stack()

In [470]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [471]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [472]:
result.unstack(level=0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [473]:
result.unstack(level='state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [474]:
s1 = pd.Series([0, 1, 2, 3], index=["a", "b", "c", "d"], dtype="Int64")

In [475]:
s2 = pd.Series([4,5,6], index=['c','d','e'], dtype='Int64')

In [476]:
data2 = pd.concat({'one':s1,'two':s2})

In [477]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [478]:
data2.unstack()

        a     b  c  d     e
one     0     1  2  3  <NA>
two  <NA>  <NA>  4  5     6

In [479]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [480]:
data2.unstack().stack(dropna=False)

/var/folders/y_/88_bvhts341bf74krgd3hgch0000gp/T/ipykernel_9605/3936770077.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  data2.unstack().stack(dropna=False)

one  a       0
     b       1
     c       2
     d       3
     e    <NA>
two  a    <NA>
     b    <NA>
     c       4
     d       5
     e       6
dtype: Int64

In [481]:
df = pd.DataFrame({"left": result, "right": result + 5}, 
                  columns=pd.Index(["left", "right"], name="side"))

In [482]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [483]:
df.unstack(level='state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [484]:
data = pd.read_csv("examples/macrodata.csv")

In [485]:
data = data.loc[:,['year','quarter','realgdp','infl','unemp']]

In [486]:
data.head()

     year  quarter   realgdp  infl  unemp
0  1959.0      1.0  2710.349  0.00    5.8
1  1959.0      2.0  2778.801  2.34    5.1
2  1959.0      3.0  2775.488  2.74    5.3
3  1959.0      4.0  2785.204  0.27    5.6
4  1960.0      1.0  2847.699  2.31    5.2

In [487]:
periods = pd.PeriodIndex(year=data.pop("year"),
                         quarter=data.pop("quarter"),
                         name="date")

/var/folders/y_/88_bvhts341bf74krgd3hgch0000gp/T/ipykernel_9605/3617454192.py:1: FutureWarning: Constructing PeriodIndex from fields is deprecated. Use PeriodIndex.from_fields instead.
  periods = pd.PeriodIndex(year=data.pop("year"),

In [488]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203)

In [489]:
data.index = periods.to_timestamp('D')

In [490]:
data.head()

             realgdp  infl  unemp
date
1959-01-01  2710.349  0.00    5.8
1959-04-01  2778.801  2.34    5.1
1959-07-01  2775.488  2.74    5.3
1959-10-01  2785.204  0.27    5.6
1960-01-01  2847.699  2.31    5.2

Here I used the pop method on the DataFrame, which returns a column while deleting it from the DataFrame at the same time.

Then, I select a subset of columns and give the columns index the name "item":

In [491]:
data = data.reindex(columns=['realgdp','infl','unemp'])

In [492]:
data.columns.name = 'item'

In [493]:
data.head()

item         realgdp  infl  unemp
date
1959-01-01  2710.349  0.00    5.8
1959-04-01  2778.801  2.34    5.1
1959-07-01  2775.488  2.74    5.3
1959-10-01  2785.204  0.27    5.6
1960-01-01  2847.699  2.31    5.2

Lastly, I reshape with stack, turn the new index levels into columns with reset_index, and finally give the column containing the data values the name "value":

In [495]:
long_data = (data.stack()
            .reset_index()
            .rename(columns={0:'value'}))

In [496]:
long_data[:10]

        date     item     value
0 1959-01-01  realgdp  2710.349
1 1959-01-01     infl     0.000
2 1959-01-01    unemp     5.800
3 1959-04-01  realgdp  2778.801
4 1959-04-01     infl     2.340
5 1959-04-01    unemp     5.100
6 1959-07-01  realgdp  2775.488
7 1959-07-01     infl     2.740
8 1959-07-01    unemp     5.300
9 1959-10-01  realgdp  2785.204

In this so-called long format for multiple time series, each row in the table represents a single observation.

In [499]:
pivoted = long_data.pivot(index='date',columns='item',values='value')

In [501]:
pivoted.head()

item        infl   realgdp  unemp
date
1959-01-01  0.00  2710.349    5.8
1959-04-01  2.34  2778.801    5.1
1959-07-01  2.74  2775.488    5.3
1959-10-01  0.27  2785.204    5.6
1960-01-01  2.31  2847.699    5.2

The first two values passed are the columns to be used, respectively, as the row and column index, then finally an optional value column to fill the DataFrame. Suppose you had two value columns that you wanted to reshape simultaneously:

In [505]:
long_data['value2'] = np.random.standard_normal(len(long_data))

In [506]:
long_data[:10]

        date     item     value    value2
0 1959-01-01  realgdp  2710.349 -0.985249
1 1959-01-01     infl     0.000 -0.060966
2 1959-01-01    unemp     5.800 -0.541769
3 1959-04-01  realgdp  2778.801  1.153803
4 1959-04-01     infl     2.340 -0.876976
5 1959-04-01    unemp     5.100  0.333119
6 1959-07-01  realgdp  2775.488  0.999782
7 1959-07-01     infl     2.740 -0.414243
8 1959-07-01    unemp     5.300  0.114993
9 1959-10-01  realgdp  2785.204 -1.213642

by ommiting the last arguement we can achieve hierarchial columns

In [507]:
pivoted = long_data.pivot(index='date',columns='item')

In [509]:
pivoted.head()

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-01-01  0.00  2710.349   5.8 -0.060966 -0.985249 -0.541769
1959-04-01  2.34  2778.801   5.1 -0.876976  1.153803  0.333119
1959-07-01  2.74  2775.488   5.3 -0.414243  0.999782  0.114993
1959-10-01  0.27  2785.204   5.6 -1.344771 -1.213642  0.912628
1960-01-01  2.31  2847.699   5.2 -0.857956 -0.595915 -0.793805

In [510]:
pivoted["value"].head()

item        infl   realgdp  unemp
date
1959-01-01  0.00  2710.349    5.8
1959-04-01  2.34  2778.801    5.1
1959-07-01  2.74  2775.488    5.3
1959-10-01  0.27  2785.204    5.6
1960-01-01  2.31  2847.699    5.2

Note that pivot is equivalent to creating a hierarchical index using set_index followed by a call to unstack:

In [513]:
unstacked = long_data.set_index(['date','item']).unstack(level='item')

In [514]:
unstacked.head()

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-01-01  0.00  2710.349   5.8 -0.060966 -0.985249 -0.541769
1959-04-01  2.34  2778.801   5.1 -0.876976  1.153803  0.333119
1959-07-01  2.74  2775.488   5.3 -0.414243  0.999782  0.114993
1959-10-01  0.27  2785.204   5.6 -1.344771 -1.213642  0.912628
1960-01-01  2.31  2847.699   5.2 -0.857956 -0.595915 -0.793805

#  Pivoting “Wide” to “Long” Format

the inverse of pivot is melt. instead of turning one column into many, it merges many into one producing a DataFrame that is longer than the input.

In [515]:
df = pd.DataFrame({'key':['foo','bar','baz'],
                  'A':[1,2,3],
                  'B':[4,5,6],
                  'C':[7,8,9]})

In [516]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [517]:
melted = pd.melt(df,id_vars='key')

In [518]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

using pivot we can reshape tpo its original form

In [519]:
reshaped = melted.pivot(index='key', columns = 'variable', values = 'value')

In [520]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

Since the result of pivot creates an index from the column used as the row labels, we may want to use reset_index to move the data back into a column:

In [521]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

you can also specify what values you want to include in your pivot

In [522]:
pd.melt(df, id_vars='key', value_vars=['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

you can also melt with out any group identifiers

In [523]:
pd.melt(df, value_vars=['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [ ]:
pd.melt(df, value_vars=["key", "A", "B"])